{
    "name": "Français (France)",
    "nameShort": "Français",
    "textDirection": "ltr",
    "strings": {
        "title": "Compte - Sousnœud",
        "subnodal": "Sousnœud",
        "signInWith": "Se connecter avec",

        "redirectTitle": "Connexion en cours ...",
        "signInTitle": "Connectez-vous au Sousnœud",
        "createTitle": "Créer un Compte Sousnœud",
        "platformErrorTitle": "Nous ne pouvons pas vous connecter pour le moment",

        "platformErrorDescription": "La plate-forme qui utilise votre Compte Sousnœud n'a pas été configurée correctement pour gérer la connexion. Veuillez réessayer plus tard ou contacter les développeurs de la plate-forme si le problème persiste.",

        "email": "Email",
        "password": "Mot de passe",
        "confirmPassword": "Confirmez le mot de passe",

        "createConsent": "J'ai lu et j'accepte les conditions d'utilisation et la politique de confidentialité.",

        "signIn": "Se connecter",
        "create": "Créer",
        "cancel": "Annuler",
        "back": "Retour",

        "error_noEmail": "Veuillez entrer un adresse email.",
        "error_noPassword": "Veuillez entrer un mot de passe.",
        "error_invalidEmail": "L'adresse email que vous avez saisie n'est pas valide.",
        "error_accountSuspended": "Votre Compte Sousnœud est suspendu. Veuillez contacter Sousnœud pour plus d'informations.",
        "error_accountNotFound": "Aucun Compte Sousnœud n'est enregistré avec cette adresse email.",
        "error_incorrectPassword": "Le mot de passe que vous avez entré est incorrect.",
        "error_consentNotGiven": "Veuillez accepter les conditions d'utilisation et la politique de confidentialité.",
        "error_accountExists": "Un Compte Sousnœud avec cette adresse email existe déjà.",
        "error_unavailable": "Désolé, l'inscription n'est pas disponible actuellement. Veuillez réessayer plus tard.",
        "error_weakPassword": "Votre mot de passe doit contenir au moins 6 caractères.",
        "error_noPasswordConfirmation": "Veuillez confirmer votre mot de passe en le saisissant à nouveau.",
        "error_passwordConfirmationMismatch": "Votre mot de passe ne correspond pas à votre mot de passe confirmé. Veuillez le saisir à nouveau.",

        "copyright": "Copyright © Subnodal Technologies. Tous les droits sont réservés."
    }
}